ERM/src/Documents/BillingCalculation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>BillingCalculation</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Billing</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>CreatedBy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CreationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModifiedBy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ModificationDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>LawsonBilling</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Company</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LegalEntity</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LegalEntiites</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AU</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>USDAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>HOBBilling</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Company</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LegalEntity</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.LegalEntiites</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>AU</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КостЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Client</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Currency</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>InitialAR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>FinalAR</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Collection</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Amount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>USDAmount</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ERM/src/InformationRegisters/ВнутренниеКурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ВнутренниеКурсыВалют</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERM/src/Documents/BillingCalculation/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ЗаполнитьДанныеПоБиллингу(СтруктураПараметров, АдресХранилища) Экспорт
	
	ДанныеДляЗаполнения = Новый Структура();
	
	ДанныеПоБиллингу = Новый Структура;
	ДанныеПоБиллингу.Вставить("LawsonBilling", РассчитатьLawsonBilling(СтруктураПараметров));
	ДанныеПоБиллингу.Вставить("HOBBilling", РассчитатьHOBBilling(СтруктураПараметров));
	
	ДанныеДляЗаполнения.Вставить("ДанныеПоБиллингу", ДанныеПоБиллингу);
	
	ПоместитьВоВременноеХранилище(ДанныеДляЗаполнения, АдресХранилища);
	
КонецПроцедуры

Функция РассчитатьLawsonBilling(СтруктураПараметров)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроводкаDSS.Ссылка КАК Ссылка,
		|	ПроводкаDSS.Company КАК Company,
		|	ПроводкаDSS.LegalEntity КАК LegalEntity,
		|	ПроводкаDSS.AU КАК AU,
		|	ПроводкаDSS.КонтрагентLawson КАК Client,
		|	ПроводкаDSS.Currency КАК Currency,
		|	ПроводкаDSS.TranAmount КАК Amount
		|ПОМЕСТИТЬ ВТ_ДанныеТранзакций
		|ИЗ
		|	Документ.ПроводкаDSS КАК ПроводкаDSS
		|ГДЕ
		|	ПроводкаDSS.Проведен
		|	И ПроводкаDSS.AccountingPeriod >= &НачалоПериода
		|	И ПроводкаDSS.AccountingPeriod <= &КонецПериода
		|	И (ПроводкаDSS.AccountLawson = &Счет120101
		|				И (ПроводкаDSS.System = ""AR""
		|						И ПроводкаDSS.SourceCode В (""SA"", ""DM"", ""CM"", ""RI"", ""RM"")
		|					ИЛИ ПроводкаDSS.System = ""BL""
		|						И ПроводкаDSS.SourceCode В (""SA"", ""DM"", ""CM"", ""RI"", ""RM""))
		|			ИЛИ ПроводкаDSS.AccountLawson = &Счет120104
		|				И (ПроводкаDSS.System = ""AR""
		|						И ПроводкаDSS.SourceCode В (""RI"", ""RM"")
		|					ИЛИ ПроводкаDSS.System = ""BL""
		|						И (ПроводкаDSS.SourceCode В (""CM"", ""DM"")
		|							ИЛИ ПроводкаDSS.SourceCode = ""JE"")
		|					ИЛИ ПроводкаDSS.System = ""GL""
		|						И ПроводкаDSS.SourceCode В (""JE"", ""S1"", ""S2"", ""S3""))
		|			ИЛИ ПроводкаDSS.AccountLawson = &Счет120201
		|				И (ПроводкаDSS.System = ""BL""
		|						И ПроводкаDSS.SourceCode = ""JE""
		|						И ПроводкаDSS.Description = ""A/R ACCRUAL""
		|					ИЛИ ПроводкаDSS.System = ""GL""
		|						И ПроводкаDSS.SourceCode В (""JE"", ""S1"", ""S2"", ""S3""))
		|			ИЛИ ПроводкаDSS.AccountLawson = &Счет120205
		|				И (ПроводкаDSS.System = ""BL""
		|						И ПроводкаDSS.SourceCode = ""JE""
		|					ИЛИ ПроводкаDSS.System = ""GL""
		|						И ПроводкаDSS.SourceCode В (""JE"", ""S1"", ""S2"", ""S3""))
		|			ИЛИ ПроводкаDSS.AccountLawson = &Счет120206
		|				И (ПроводкаDSS.System = ""AR""
		|						И ПроводкаDSS.SourceCode В (""RI"", ""RM"")
		|					ИЛИ ПроводкаDSS.System = ""BL""
		|						И (ПроводкаDSS.SourceCode В (""CM"", ""DM"")
		|							ИЛИ ПроводкаDSS.SourceCode = ""JE"")
		|					ИЛИ ПроводкаDSS.System = ""GL""
		|						И ПроводкаDSS.SourceCode В (""JE"", ""S1"", ""S2"", ""S3"")))
		|
		|СГРУППИРОВАТЬ ПО
		|	ПроводкаDSS.Ссылка,
		|	ПроводкаDSS.Company,
		|	ПроводкаDSS.LegalEntity,
		|	ПроводкаDSS.AU,
		|	ПроводкаDSS.КонтрагентLawson,
		|	ПроводкаDSS.Currency,
		|	ПроводкаDSS.TranAmount
		|
		|ИМЕЮЩИЕ
		|	СУММА(ПроводкаDSS.TranAmount) <> 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеТранзакций.Company КАК Company,
		|	ВТ_ДанныеТранзакций.LegalEntity КАК LegalEntity,
		|	ВТ_ДанныеТранзакций.AU КАК AU,
		|	ВТ_ДанныеТранзакций.Client КАК Client,
		|	ВТ_ДанныеТранзакций.Currency КАК Currency,
		|	СУММА(ВТ_ДанныеТранзакций.Amount) КАК Amount,
		|	СУММА(ВЫРАЗИТЬ(ВТ_ДанныеТранзакций.Amount / ЕСТЬNULL(ВнутренниеКурсыВалютСрезПоследних.Курс, 1) * ЕСТЬNULL(ВнутренниеКурсыВалютСрезПоследних.Кратность, 1) КАК ЧИСЛО(15, 2))) КАК USDAmount
		|ИЗ
		|	ВТ_ДанныеТранзакций КАК ВТ_ДанныеТранзакций
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВнутренниеКурсыВалют.СрезПоследних(
		|				ДОБАВИТЬКДАТЕ(&КонецПериода, СЕКУНДА, 1),
		|				Валюта В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ВТ_ДанныеТранзакций.Currency
		|					ИЗ
		|						ВТ_ДанныеТранзакций КАК ВТ_ДанныеТранзакций)) КАК ВнутренниеКурсыВалютСрезПоследних
		|		ПО ВТ_ДанныеТранзакций.Currency = ВнутренниеКурсыВалютСрезПоследних.Валюта
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДанныеТранзакций.Company,
		|	ВТ_ДанныеТранзакций.LegalEntity,
		|	ВТ_ДанныеТранзакций.AU,
		|	ВТ_ДанныеТранзакций.Client,
		|	ВТ_ДанныеТранзакций.Currency";
	
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(СтруктураПараметров.Дата));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(СтруктураПараметров.Дата));
	Запрос.УстановитьПараметр("Счет120101", ПланыСчетов.Lawson.НайтиПоКоду("120101"));
	Запрос.УстановитьПараметр("Счет120104", ПланыСчетов.Lawson.НайтиПоКоду("120104"));
	Запрос.УстановитьПараметр("Счет120201", ПланыСчетов.Lawson.НайтиПоКоду("120201"));
	Запрос.УстановитьПараметр("Счет120205", ПланыСчетов.Lawson.НайтиПоКоду("120205"));
	Запрос.УстановитьПараметр("Счет120206", ПланыСчетов.Lawson.НайтиПоКоду("120206"));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция РассчитатьHOBBilling(СтруктураПараметров)
	
КонецФункции

#КонецЕсли
